Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG01100.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ITM</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Instrumentation Macrocell</description>
         <baseAddress>0xE0000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>STIM[%s]</name>
               <description>ITM Stimulus Port Register n</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FIFOREADY</name>
                     <description>Stimulus port can accept data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISABLED</name>
                     <description>Stimulus port enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>256</dim>
               <dimIncrement>4</dimIncrement>
               <name>STIM_WRITE_MODE[%s]</name>
               <description>ITM Stimulus Port Register n</description>
               <alternateRegister>STIM[%s]</alternateRegister>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>STIMULUS</name>
                     <description>Stimulus data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>TER[%s]</name>
               <description>ITM Trace Enable Register n</description>
               <addressOffset>0xE00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>STIMENA0</name>
                     <description>Stimulus port 0 enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA1</name>
                     <description>Stimulus port 1 enabled</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA2</name>
                     <description>Stimulus port 2 enabled</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA3</name>
                     <description>Stimulus port 3 enabled</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA4</name>
                     <description>Stimulus port 4 enabled</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA5</name>
                     <description>Stimulus port 5 enabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA6</name>
                     <description>Stimulus port 6 enabled</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA7</name>
                     <description>Stimulus port 7 enabled</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA8</name>
                     <description>Stimulus port 8 enabled</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA9</name>
                     <description>Stimulus port 9 enabled</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA10</name>
                     <description>Stimulus port 10 enabled</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA11</name>
                     <description>Stimulus port 11 enabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA12</name>
                     <description>Stimulus port 12 enabled</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA13</name>
                     <description>Stimulus port 13 enabled</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA14</name>
                     <description>Stimulus port 14 enabled</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA15</name>
                     <description>Stimulus port 15 enabled</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA16</name>
                     <description>Stimulus port 16 enabled</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA17</name>
                     <description>Stimulus port 17 enabled</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA18</name>
                     <description>Stimulus port 18 enabled</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA19</name>
                     <description>Stimulus port 19 enabled</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA20</name>
                     <description>Stimulus port 20 enabled</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA21</name>
                     <description>Stimulus port 21 enabled</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA22</name>
                     <description>Stimulus port 22 enabled</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA23</name>
                     <description>Stimulus port 23 enabled</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA24</name>
                     <description>Stimulus port 24 enabled</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA25</name>
                     <description>Stimulus port 25 enabled</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA26</name>
                     <description>Stimulus port 26 enabled</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA27</name>
                     <description>Stimulus port 27 enabled</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA28</name>
                     <description>Stimulus port 28 enabled</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA29</name>
                     <description>Stimulus port 29 enabled</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA30</name>
                     <description>Stimulus port 30 enabled</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STIMENA31</name>
                     <description>Stimulus port 31 enabled</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPR</name>
               <description>ITM Trace Privilege Register</description>
               <addressOffset>0xE40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRIVMASK0</name>
                     <description>Privilege mask for stimulus port byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK1</name>
                     <description>Privilege mask for stimulus port byte 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK2</name>
                     <description>Privilege mask for stimulus port byte 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK3</name>
                     <description>Privilege mask for stimulus port byte 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK4</name>
                     <description>Privilege mask for stimulus port byte 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK5</name>
                     <description>Privilege mask for stimulus port byte 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK6</name>
                     <description>Privilege mask for stimulus port byte 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK7</name>
                     <description>Privilege mask for stimulus port byte 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK8</name>
                     <description>Privilege mask for stimulus port byte 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK9</name>
                     <description>Privilege mask for stimulus port byte 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK10</name>
                     <description>Privilege mask for stimulus port byte 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK11</name>
                     <description>Privilege mask for stimulus port byte 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK12</name>
                     <description>Privilege mask for stimulus port byte 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK13</name>
                     <description>Privilege mask for stimulus port byte 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK14</name>
                     <description>Privilege mask for stimulus port byte 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK15</name>
                     <description>Privilege mask for stimulus port byte 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK16</name>
                     <description>Privilege mask for stimulus port byte 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK17</name>
                     <description>Privilege mask for stimulus port byte 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK18</name>
                     <description>Privilege mask for stimulus port byte 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK19</name>
                     <description>Privilege mask for stimulus port byte 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK20</name>
                     <description>Privilege mask for stimulus port byte 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK21</name>
                     <description>Privilege mask for stimulus port byte 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK22</name>
                     <description>Privilege mask for stimulus port byte 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK23</name>
                     <description>Privilege mask for stimulus port byte 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK24</name>
                     <description>Privilege mask for stimulus port byte 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK25</name>
                     <description>Privilege mask for stimulus port byte 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK26</name>
                     <description>Privilege mask for stimulus port byte 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK27</name>
                     <description>Privilege mask for stimulus port byte 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK28</name>
                     <description>Privilege mask for stimulus port byte 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK29</name>
                     <description>Privilege mask for stimulus port byte 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK30</name>
                     <description>Privilege mask for stimulus port byte 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVMASK31</name>
                     <description>Privilege mask for stimulus port byte 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCR</name>
               <description>ITM Trace Control Register</description>
               <addressOffset>0xE80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ITMENA</name>
                     <description>ITM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSENA</name>
                     <description>Timestamp enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCENA</name>
                     <description>Synchronization enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXENA</name>
                     <description>Transmit enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWOENA</name>
                     <description>SWO enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLENA</name>
                     <description>Stall enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSPrescale</name>
                     <description>Timestamp prescale</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GTSFREQ</name>
                     <description>Global timestamp frequency</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TraceBusID</name>
                     <description>Trace bus identity</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>ITM busy</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LAR</name>
               <description>ITM Software Lock Access Register</description>
               <addressOffset>0xFB0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY</name>
                     <description>Lock access control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>UNLOCK</name>
                           <description>Unlock key value</description>
                           <value>0xC5ACCE55</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
