Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1012SG01100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="MPU">
         <name>MPU_NS</name>
         <baseAddress>0xE002ED90</baseAddress>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <version>SYSTEM_IP1.0.0</version>
         <description>Nested Vectored Interrupt Controller</description>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xE04</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISER[%s]</name>
               <description>Interrupt Set Enable Register n</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Set enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICER[%s]</name>
               <description>Interrupt Clear Enable Register n</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Clear enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>ISPR[%s]</name>
               <description>Interrupt Set Pending Register n</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Set pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>ICPR[%s]</name>
               <description>Interrupt Clear Pending Register n</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Clear pending</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>IABR[%s]</name>
               <description>Interrupt Active Bit Register n</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>Active state</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>5</dim>
               <dimIncrement>4</dimIncrement>
               <name>ITNS[%s]</name>
               <description>Interrupt Target Non-secure Register n</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ITNS</name>
                     <description>Interrupt Targets Non-secure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>40</dim>
               <dimIncrement>4</dimIncrement>
               <name>IPR[%s]</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRI_N0</name>
                     <description>Priority of interrupt number 4n+0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N1</name>
                     <description>Priority of interrupt number 4n+1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N2</name>
                     <description>Priority of interrupt number 4n+2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PRI_N3</name>
                     <description>Priority of interrupt number 4n+3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STIR</name>
               <description>Software Triggered Interrupt Register</description>
               <addressOffset>0xE00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt ID of the interrupt to trigger, in the range 0-479. For example, a value of 0x03 specifies interrupt IRQ3.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
